from Crypto.Util.number import long_to_bytes
from functools import reduce

txt = "‎‎ㅤㅤ‎‎‎‎‎ㅤㅤㅤㅤ‎‎‎‎ㅤ‎‎ㅤ‎‎‎‎‎ㅤㅤ‎‎‎‎‎ㅤ‎ㅤ‎‎‎‎‎‎ㅤㅤ‎‎ㅤㅤ‎ㅤㅤㅤㅤ‎ㅤㅤ‎ㅤㅤㅤ‎‎ㅤㅤ‎ㅤㅤㅤ‎ㅤ‎ㅤ‎ㅤㅤㅤ‎‎‎‎‎ㅤㅤ‎‎ㅤ‎ㅤ‎ㅤㅤㅤ‎‎ㅤ‎‎ㅤ‎ㅤㅤㅤㅤㅤ‎ㅤㅤㅤ‎‎ㅤㅤ‎ㅤㅤ‎ㅤ‎‎‎‎ㅤㅤ‎ㅤㅤㅤㅤ‎ㅤㅤㅤ‎‎ㅤ‎‎ㅤㅤㅤ‎ㅤ‎‎‎ㅤ‎ㅤㅤㅤㅤㅤ‎ㅤㅤㅤ‎ㅤ‎ㅤ‎ㅤㅤ‎ㅤㅤㅤ‎‎ㅤㅤ‎ㅤ‎‎ㅤ‎ㅤㅤ‎‎‎ㅤㅤ‎ㅤㅤ‎ㅤㅤㅤㅤ‎ㅤㅤ‎‎ㅤ‎‎‎ㅤㅤ‎‎ㅤ‎ㅤ‎ㅤ‎ㅤㅤㅤㅤㅤ‎ㅤㅤㅤ‎ㅤㅤㅤ‎ㅤㅤ‎ㅤ‎‎‎‎ㅤㅤ‎‎‎‎ㅤ‎ㅤㅤㅤ‎ㅤ‎‎‎ㅤㅤㅤ‎ㅤ‎‎‎ㅤㅤ‎ㅤ‎‎‎‎ㅤㅤ‎‎ㅤ‎ㅤ‎ㅤㅤ‎ㅤ‎‎‎‎ㅤㅤ‎‎ㅤ‎ㅤ‎ㅤㅤ‎‎‎ㅤㅤ‎ㅤㅤ‎ㅤ‎ㅤㅤ‎ㅤㅤㅤㅤㅤ‎ㅤ"
print(hex(ord("‎")), hex(ord("ㅤ")))
txt = reduce(lambda acc, cur: (acc << 1) + (1 if cur == "\u3164" else 0), txt, 0)
print(long_to_bytes(txt).decode())
